src/Reports/УстановкаКритическихОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>УстановкаКритическихОстатков</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/InformationRegisters/КритическиеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КритическиеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Минимальное количество номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Comment>Упаковка для данного вида номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Comment>Содержит список складов и сотрудников (номенклатура может хранится у сотрудника)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ПартииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПартииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/УстановкаКритическихОстатков/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктурнаяЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	УстановитьВариантОтчета(СУчетомПарти);
	УстановитьПараметрыКомпоновкиОтчета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкомпоноватьДанныеРезультата()
	
    УстановитьПараметрВСКД();
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
// Обработчик события ОбработкаРасшифровки элемента Результат.
//
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьДанныеРасшифровки(Расшифровка);
	
	Если СтруктураПараметров.Свойство("КоличествоБП") Тогда
		Количество = СтруктураПараметров.КоличествоБП;
		СтруктураПараметров.Удалить("КоличествоБП");
		СтруктураПараметров.Вставить("Количество", Количество);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("НоменклатураБП") Тогда
		Номенклатура = СтруктураПараметров.НоменклатураБП;
		СтруктураПараметров.Удалить("НоменклатураБП");
		СтруктураПараметров.Вставить("Номенклатура", Номенклатура);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("СкладБП") Тогда
		Склад = СтруктураПараметров.СкладБП;
		СтруктураПараметров.Удалить("СкладБП");
		СтруктураПараметров.Вставить("Склад", Склад);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("СтруктурнаяЕдиница") И СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("Склад") Тогда
		СуществованиеОбъекта = ПроверкаСуществованияЭлемента(СтруктураПараметров);
		Если СуществованиеОбъекта Тогда 
			Изменить(Неопределено);
		Иначе
			СозданиеЭлемента = Новый Структура("Номенклатура", СтруктураПараметров.Номенклатура);
			СозданиеЭлемента.Вставить("Партия", ?(СтруктураПараметров.Свойство("Партия"), СтруктураПараметров.Партия, ПредопределенноеЗначение("Справочник.ПартииНоменклатуры.ПустаяСсылка")));
			СозданиеЭлемента.Вставить("Склад", СтруктураПараметров.Склад);
			СозданиеЭлемента.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиницаОтбор);
			Оповещение = Новый ОписаниеОповещения("КритическиеОстаткиЗаписьЗавершение", ЭтотОбъект);

			ОткрытьФорму("РегистрСведений.КритическиеОстатки.Форма.ФормаЗаписи", СозданиеЭлемента,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;	
	ИначеЕсли СтруктураПараметров.Свойство("Основной") И СтруктураПараметров.Основной <> NULL Тогда
		ОткрытьФорму(ВернутьПолноеИмяФормы(СтруктураПараметров.Основной, ПроверкаИерархии(Расшифровка)), Новый Структура("Ключ", СтруктураПараметров.Основной),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		СкомпоноватьДанныеРезультата();
		ПроверкаФиксации();
	КонецЕсли;                             
	
КонецПроцедуры

&НаКлиенте
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	
	УстановитьПараметрВСКД();
	СкомпоноватьДанныеРезультата();
	ПроверкаФиксации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды Добавить.
//
Процедура Добавить(Команда)
	
	Параметр = Новый Структура("ДобавлениеНового", Истина);
	Параметр.Вставить("СтруктурнаяЕдиница",СтруктурнаяЕдиницаОтбор); 
	Оповещение = Новый ОписаниеОповещения("КритическиеОстаткиЗаписьЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.КритическиеОстатки.Форма.ФормаЗаписи", Параметр,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Скопировать.
//
Процедура Скопировать(Команда)

	СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	
	Если СтруктураПараметров.Свойство("КоличествоБП") Тогда
		Количество = СтруктураПараметров.КоличествоБП;
		СтруктураПараметров.Удалить("КоличествоБП");
		СтруктураПараметров.Вставить("Количество", Количество);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("НоменклатураБП") Тогда
		Номенклатура = СтруктураПараметров.НоменклатураБП;
		СтруктураПараметров.Удалить("НоменклатураБП");
		СтруктураПараметров.Вставить("Номенклатура", Номенклатура);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("СкладБП") Тогда
		Склад = СтруктураПараметров.СкладБП;
		СтруктураПараметров.Удалить("СкладБП");
		СтруктураПараметров.Вставить("Склад", Склад);
	КонецЕсли;
	
	Если Не (СтруктураПараметров.Свойство("СтруктурнаяЕдиница") И СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("Склад")) Тогда
		Возврат;
	КонецЕсли;	
	Оповещение = Новый ОписаниеОповещения("КритическиеОстаткиЗаписьЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.КритическиеОстатки.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров),,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Изменить.
//
Процедура Изменить(Команда)
	                           
	СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	
	Если СтруктураПараметров.Свойство("КоличествоБП") Тогда
		Количество = СтруктураПараметров.КоличествоБП;
		СтруктураПараметров.Удалить("КоличествоБП");
		СтруктураПараметров.Вставить("Количество", Количество);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("НоменклатураБП") Тогда
		Номенклатура = СтруктураПараметров.НоменклатураБП;
		СтруктураПараметров.Удалить("НоменклатураБП");
		СтруктураПараметров.Вставить("Номенклатура", Номенклатура);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("СкладБП") Тогда
		Склад = СтруктураПараметров.СкладБП;
		СтруктураПараметров.Удалить("СкладБП");
		СтруктураПараметров.Вставить("Склад", Склад);
	КонецЕсли;
	
	Если Не (СтруктураПараметров.Свойство("СтруктурнаяЕдиница") И СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("Склад")) Тогда
		Возврат;
	КонецЕсли;
	
	КлючЗаписиСтруктурой = ПолучитьКлючЗаписи(СтруктураПараметров);
	Если КлючЗаписиСтруктурой <> Неопределено Тогда
		ПараметрыМассив = Новый Массив;
		ПараметрыМассив.Добавить(КлючЗаписиСтруктурой);   		
		КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.КритическиеОстатки", ПараметрыМассив);
		
		Оповещение = Новый ОписаниеОповещения("КритическиеОстаткиЗаписьЗавершение", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.КритическиеОстатки.Форма.ФормаЗаписи", Новый Структура("Ключ, КомандаИзменить", КлючЗаписиРегистра, Истина),,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Удалить.
//
Процедура Удалить(Команда)
	
	СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	
	Если СтруктураПараметров.Свойство("КоличествоБП") Тогда
		Количество = СтруктураПараметров.КоличествоБП;
		СтруктураПараметров.Удалить("КоличествоБП");
		СтруктураПараметров.Вставить("Количество", Количество);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("НоменклатураБП") Тогда
		Номенклатура = СтруктураПараметров.НоменклатураБП;
		СтруктураПараметров.Удалить("НоменклатураБП");
		СтруктураПараметров.Вставить("Номенклатура", Номенклатура);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("СкладБП") Тогда
		Склад = СтруктураПараметров.СкладБП;
		СтруктураПараметров.Удалить("СкладБП");
		СтруктураПараметров.Вставить("Склад", Склад);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("Склад") Тогда
		УдалитьНаСервере(СтруктураПараметров);
		СкомпоноватьДанныеРезультата();
		ПроверкаФиксации();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Обновить.
//
Процедура Обновить(Команда)
	
	СкомпоноватьДанныеРезультата();
	ПроверкаФиксации();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Печать.
//
Процедура Печать(Команда)
		
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;

	Результат.КоличествоЭкземпляров = 1;

	Если НЕ Результат.АвтоМасштаб И НЕ ЗначениеЗаполнено(Результат.ИмяПринтера) Тогда
		Результат.АвтоМасштаб = Истина;
	КонецЕсли;
	
	Результат.Напечатать(Ложь);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды ОтображатьЗаголовок.
//
Процедура ОтображатьЗаголовок(Команда)
		
	Элементы.ОтображатьЗаголовок.Пометка = НЕ Элементы.ОтображатьЗаголовок.Пометка;
	УстановитьПараметрыКомпоновкиОтчета();
	
	Результат.ФиксацияСверху = 0;
	Результат.ФиксацияСлева = 0;
	
	СкомпоноватьДанныеРезультата();
	Если Элементы.ОтображатьЗаголовок.Пометка Тогда
		СдвинутьОбластьДляЗаголовка();
		Результат.ФиксацияСверху = 5;
		Результат.ФиксацияСлева = 1;
	Иначе
		Результат.ФиксацияСверху = 2;
		Результат.ФиксацияСлева = 1;
	КонецЕсли;
	
КонецПроцедуры     

// Процедура - С учетом парти при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура СУчетомПартиПриИзменении(Элемент)
	
	УстановитьВариантОтчета(СУчетомПарти);
	СкомпоноватьДанныеРезультата();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура удаляет запись регистра.
//
Процедура УдалитьНаСервере(СтруктураПараметров)

	КлючЗаписи = ПолучитьКлючЗаписи(СтруктураПараметров);

	Если КлючЗаписи <> Неопределено Тогда
		
		НаборЗаписей = РегистрыСведений.КритическиеОстатки.СоздатьНаборЗаписей();
		Для каждого ЭлементСтруктуры Из КлючЗаписи Цикл
			НаборЗаписей.Отбор[ЭлементСтруктуры.Ключ].Установить(ЭлементСтруктуры.Значение);	
		КонецЦикла; 
		НаборЗаписей.Записать();
	
	КонецЕсли; 	

КонецПроцедуры // Удалить()

&НаСервере
// Функция возвращает ключ записи регистра.
//
// Параметры
//  <СтруктураПараметров>	- Структура	- Структура параметров расшифровки
//
// Возвращаемое значение:
//   <Структура>			- ключ записи регистра
//
Функция ПолучитьКлючЗаписи(СтруктураПараметров)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	   |	КритическиеОстатки.Номенклатура,
	   |	КритическиеОстатки.Количество,
	   |	КритическиеОстатки.Партия
	   |ИЗ
	   |	РегистрСведений.КритическиеОстатки КАК КритическиеОстатки
	   |ГДЕ
	   |	КритическиеОстатки.Номенклатура = &Номенклатура
	   |	И КритическиеОстатки.Склад = &Склад
	   |	И КритическиеОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	   |	И КритическиеОстатки.Партия = &Партия";

	Запрос.УстановитьПараметр("Номенклатура", 		СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Партия", 			?(СтруктураПараметров.Свойство("Партия"), СтруктураПараметров.Партия, Справочники.ПартииНоменклатуры.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Склад", 				СтруктураПараметров.Склад);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктураПараметров.СтруктурнаяЕдиница);

	СтруктураВозврата = Новый Структура("Номенклатура, Партия, СтруктурнаяЕдиница, Склад");	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураПараметров);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультат.Количество() > 0 Тогда
		СтруктураВозврата.Номенклатура 		= ТаблицаРезультат[0].Номенклатура;
		СтруктураВозврата.Партия 			= ТаблицаРезультат[0].Партия;
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКлючЗаписи()

&НаСервере
// Функция возвращает данные расшифровки по расшифровке поля
//
// Параметры
//  <Расшифровка>	- ИндентификаторРасшифровки - Расшифровка ячейки
//
// Возвращаемое значение:
//   <Структура>	- Структура параметров расшифровки
//
Функция ПолучитьДанныеРасшифровки(Расшифровка)

	СтруктураПараметров = Новый Структура("СтруктурнаяЕдиница");
	
	СтруктураПараметров.СтруктурнаяЕдиница = СтруктурнаяЕдиницаОтбор;
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда		
		
		ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных));		
		ЭлементРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы.Получить(Расшифровка);		
		
		Для Каждого ЭлементПоля Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			СтруктураПараметров.Вставить(ЭлементПоля.Поле, ЭлементПоля.Значение);
			Если СтруктураПараметров.Свойство("Основной") Тогда
				СтруктураПараметров.Основной = ЭлементПоля.Значение;
			Иначе
				СтруктураПараметров.Вставить("Основной", ЭлементПоля.Значение);
			КонецЕсли;                  
		КонецЦикла;	
		Для Каждого ЭлементРодителя Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
			Для Каждого ЭлементРКД Из ЭлементРодителя.ПолучитьПоля() Цикл
				СтруктураПараметров.Вставить(ЭлементРКД.Поле, ЭлементРКД.Значение);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции // ОткрытьФормуЭлементаСправочника()

&НаСервере
// Функция проверяет существование элемента в регистре сведений КритическиеОстатки по измерениям "Номенклатура", 
// "СтруктурнаяЕдиница" и "Склад" и возвращает булево значение.
//
Функция ПроверкаСуществованияЭлемента(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	КритическиеОстатки.Номенклатура
	   |ИЗ
	   |	РегистрСведений.КритическиеОстатки КАК КритическиеОстатки
	   |ГДЕ
	   |	КритическиеОстатки.Номенклатура = &Номенклатура
	   |	И КритическиеОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	   |	И КритическиеОстатки.Склад = &Склад
	   |	И КритическиеОстатки.Партия = &Партия";

	Запрос.УстановитьПараметр("Номенклатура", 		СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Партия",				?(СтруктураПараметров.Свойство("Партия"), СтруктураПараметров.Партия, Справочники.ПартииНоменклатуры.ПустаяСсылка()));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктураПараметров.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Склад",				СтруктураПараметров.Склад);

	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультат.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаСервере
// Процедура устанавливает параметр СтруктурнаяЕдиница в СКД.
//
Процедура УстановитьПараметрВСКД()
	                          
	ЭлементыПараметраДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ЭлементыПараметраДанных.Найти("СтруктурнаяЕдиница").Значение = СтруктурнаяЕдиницаОтбор;
	ЭлементыПараметраДанных.Найти("СтруктурнаяЕдиница").Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает ширину фиксации с учетом заголовка таблицы.
//
Процедура ПроверкаФиксации()
	
	Если Элементы.ОтображатьЗаголовок.Пометка Тогда
		Результат.ФиксацияСверху = 5;
		Результат.ФиксацияСлева = 1;
	Иначе
		Результат.ФиксацияСверху = 2;
		Результат.ФиксацияСлева = 1;
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
// Функция возвращает булево значение иерархии расшифровки.
//
// Параметры
//  <Расшифровка>  - ИндентификаторРасшифровки - Расшифровка ячейки
//
// Возвращаемое значение:
//   <Булево>   - Значение иерархии расшифровки
//
Функция ПроверкаИерархии(Расшифровка)
	
	Возврат ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы.Получить(Расшифровка).ПолучитьПоля()[0].Иерархия;
	
КонецФункции

&НаСервере
// Функция возвращает полный путь к форме объекта справочника
//
Функция ВернутьПолноеИмяФормы(Ссылка, Группа)
	
	Если Группа Тогда
		ПолноеИмяФормыСсылки = "Справочник." + Ссылка.Метаданные().Имя + ".ФормаГруппы";
	Иначе
		ПолноеИмяФормыСсылки = "Справочник." + Ссылка.Метаданные().Имя + ".Форма.ФормаЭлемента";
	КонецЕсли;
	Возврат ПолноеИмяФормыСсылки;
	
КонецФункции

&НаСервере
// Процедура устанавливает значения параметра отчета из реквизитов.
//
Процедура УстановитьПараметрыКомпоновкиОтчета()
	
	ЭлементыПараметраВывода = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы;	
	
	ЭлементыПараметраВывода.Найти("Заголовок").Значение = "Критические остатки" + Символы.ПС + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ЭлементыПараметраВывода.Найти("Заголовок").Использование = Элементы.ОтображатьЗаголовок.Пометка;
	
КонецПроцедуры

&НаСервере
// Процедура создает область для заголовка таблицы.
//
Процедура СдвинутьОбластьДляЗаголовка()
	
	Если Результат.Область(1,1).Текст = "Группа" Тогда
		Результат.ВставитьОбласть(Результат.Область(1,1), Результат.Область(1,1), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекПользовательскиеНастройкиПриИзменении(Элемент)
		
	УстановитьПараметрыКомпоновкиОтчета();
	// Формируем результирующую таблицу только по кнопке "сформировать" 
	// СкомпоноватьДанныеРезультата();
	// ПроверкаФиксации();

КонецПроцедуры

&НаКлиенте
// Процедура - Критические остатки запись завершение.
//
// Параметры:
//  РезультатОтвета	 - 	 - 
//  ДопПараметры	 - 	 - 
//
Процедура КритическиеОстаткиЗаписьЗавершение(РезультатОтвета, ДопПараметры)  Экспорт
	
	Если ТипЗнч(РезультатОтвета) = Тип("Структура") Тогда
		
		ФормаЗаписана = Ложь;
		РезультатОтвета.Свойство("ФормаЗаписана", ФормаЗаписана);
		
		Если ФормаЗаписана <> Неопределено
			И ФормаЗаписана Тогда
			СкомпоноватьДанныеРезультата();
			ПроверкаФиксации();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтчета(СУчетомПарти)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ЭтотОбъект.СхемаКомпоновкиДанных;
	Варианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	СтруктураВариантов = Новый Структура();
    Для Каждого ЭлементВариантов ИЗ Варианты Цикл
        СтруктураВариантов.Вставить(ЭлементВариантов.Имя,ЭлементВариантов.Настройки);
	КонецЦикла; 
	Если СУчетомПарти = Ложь Тогда
		Настройки = СтруктураВариантов.СУчетомПартий;
	Иначе
		Настройки = СтруктураВариантов.БезУчетаПартий;
	КонецЕсли;
	ЭлементыПараметраДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ЭлементыПараметраДанных.Найти("СтруктурнаяЕдиница").Значение = СтруктурнаяЕдиницаОтбор;
	ЭлементыПараметраДанных.Найти("СтруктурнаяЕдиница").Использование = Истина;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
КонецПроцедуры

#КонецОбласти
